In [215]:
import numpy as np

In [216]:
a=np.array([[1,6],[2,8],[3,11],[3,10],[1,7]])

mean_a=np.mean(a,axis=0)

In [217]:
mean_a

array([2. , 8.4])

In [218]:
a_centered=a-mean_a

In [219]:
a_centered

array([[-1. , -2.4],
       [ 0. , -0.4],
       [ 1. ,  2.6],
       [ 1. ,  1.6],
       [-1. , -1.4]])

In [220]:
a_centered_sp=a_centered[0:,0:1].T[0] @ a_centered[0:,1:2].T[0]

In [221]:
cov1=a_centered_sp/4

In [222]:
cov1

2.0

In [223]:
cov2=np.cov(a.T)[0,1]

In [224]:
cov2

2.0

In [225]:
import pandas as pd

In [226]:
authors = pd.DataFrame({
    "author_id": [1, 2, 3],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
})

In [227]:
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [228]:
book = pd.DataFrame({
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
})

In [229]:
book

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

In [230]:
authors_price=pd.merge(authors, book, on='author_id', how='inner')

In [231]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [232]:
top5=authors_price.sort_values(by="price", inplace=False).head(5)

In [233]:
top5

   author_id author_name            book_title  price
6          3  Островский  Таланты и поклонники    290
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
5          3  Островский                 Гроза    370
0          1    Тургенев           Отцы и дети    450

In [234]:
authors_price.groupby("author_name").agg(min_price=('price', 'min'), max_price=('price', 'max'),mean_price=('price', 'mean'))

             min_price  max_price  mean_price
author_name
Островский         290        370  330.000000
Тургенев           300        450  366.666667
Чехов              450        500  475.000000

In [235]:
extra_row=pd.DataFrame({
    "cover": ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']})

In [236]:
authors_price=authors_price.merge(extra_row,left_index = True, right_index = True)

In [237]:
authors_price

   author_id author_name            book_title  price    cover
0          1    Тургенев           Отцы и дети    450  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
3          2       Чехов      Толстый и тонкий    500  твердая
4          2       Чехов       Дама с собачкой    450  твердая
5          3  Островский                 Гроза    370   мягкая
6          3  Островский  Таланты и поклонники    290   мягкая

In [238]:
book_info=authors_price.pivot_table(index="author_name",columns="cover",values="price",aggfunc="sum",fill_value=0)

In [239]:
book_info

cover        мягкая  твердая
author_name
Островский      660        0
Тургенев        650      450
Чехов             0      950

In [240]:
book_info.to_pickle('book_info.pkl')

In [241]:
book_info2 = pd.read_pickle('book_info.pkl')

In [242]:
book_info.equals(book_info2)

True